Revit 2025 API
TagOrientation Enumeration
 An enumerated type listing tag orientation options that are supported by IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TagOrientation
Public Enumeration TagOrientation
public enum class TagOrientation
type TagOrientation
Members
Member name | Value | Description
Horizontal | 0 |  The Orientation of tag is Horizontal.
Vertical | 1 |  The Orientation of tag is Vertical.
AnyModelDirection | 2 |  The orientation of tag is Model.
See Also
Reference
Autodesk.Revit.DB Namespace